Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateRiser Property
 Can't create geometry for one or more risers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateRiser { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateRiser As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateRiser {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace